int/resources/objectRepo/xmlTemplates/opera/ResourceConfigService/req_CreateItemClasses.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateItemClassesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:ItemClasses>
            <v91:ItemClass>
               <v91:HotelCode/>
               <v91:Code/>
               <v91:Description/>
               <v91:Type/>
               <v91:ClassID/>
               <v91:DisplaySequence/>
               <v91:EventTypes>
                  <v91:Code/>
               </v91:EventTypes>
               <v91:Departments>
                  <v91:Code/>
               </v91:Departments>
               <v91:Discountable/>
               <v91:WebBookable/>
               <v91:OverrideWarnings/>
               <v91:DiscountOverrideWarnings/>
            </v91:ItemClass>
         </v9:ItemClasses>
      </v9:CreateItemClassesRQ>
   </soapenv:Body>
</soapenv:Envelope>